#Выведите в цикле while следующую последовательность
a = 0
print(a)
