#Выведите в цикле while следующую последовательность
num = list(range(1, 14))
num.reverse()
print(num)

print('Задание 2')
#Отобразите сумму каждого второго числа в промежутке от 1 до 20
a = list(range(1,21))

print('Задание 3')
#Вычислите среднее арифметическое значение в промежутке между 15 и 30 и отобразите на экране

print('Задание 4')
#Выведите столбец чисел от 34 до 67 с выводом только четных
numList = list(range(37,67))
x = 1
while x >= 0:
    if x % 2 == 0:
        print(numList)
        x = x + 1


